<template>
  <section>
    <Banner :banner="banner"/>
    <div class="max-w-[846px] mx-auto px-6 lg:px-0">
      <div class="mt-20">
        <Rule v-for="rule in rules" :key="rule.id" :rule="rule" class="mb-8"/>
        <div class="grid grid-cols-1 sm:grid-cols-3 md:grid-cols-4 gap-6">
          <Document v-for="document in documents" :key="document.id" :document="document"/>
        </div>
      </div>
    </div>
  </section>
</template>
<script>
export default {
  name: 'SafeOperation',
  data() {
    return {
      banner: {
        id: 1,
        type: 'cards',
        name: 'Индивидальный банковский сейф',
        description: 'Удобное надежное и безопасное место для хранения ценностей',
        img: {
          src: '/image/rko.webp',
          alt: 'Safe Operation'
        },
        buttonOpenApplication: {
          text: 'Открыть'
        },
        buttonSinglePage: {
          text: 'Подробнее'
        }
      },
      rules: [
        {
          id: 1,
          title: 'Надежное место',
          description: 'Согласитесь, хранить ценности в матраце, под подушкой или даже в тайнике, спрятанном в гостиной за пейзажем, — это несколько старомодно. ССБ⁠ предлагает вам удобное, надежное и безопасное место для хранения ценностей — индивидуальный банковский сейф. В индивидуальном сейфе можно хранить деньги, ювелирные изделия, документы, ценные бумаги, произведения искусства — словом, все, чем вы дорожите, и что вам, возможно, хотелось бы скрыть от посторонних глаз.'
        },
        {
          id: 2,
          title: 'Любой срок хранения',
          description: 'Арендовать индивидуальный сейф можно на любой срок — от одной недели до нескольких лет. Небольшие сроки аренды особенно удобны в тех случаях, когда вы собираетесь в отпуск или командировку.'
        },
        {
          id: 3,
          title: 'Мой сейф — моя крепость',
          description: 'Индивидуальные сейфы находятся в специально оборудованном помещении ССБ — депозитарии. Помещение депозитария оснащено самыми современными средствами защиты и круглосуточно охраняется. Сейфы представляют собой ячейки различных размеров в бронированном шкафу. Размер ячейки вы выбираете сами, в зависимости от ваших потребностей. Сейф закрывается двумя замками — электронным и механическим. Можете быть спокойны: доступ к ценностям третьих лиц (включая сотрудников банка) исключен. Ключами от сейфа обладаете только вы. Услуга предоставляется в отделениях ССБ с идентификатором «Аренда индивидуальных банковских сейфов».'
        },
        {
          id: 4,
          title: 'Конфиденциальность',
          description: 'Объяснив вам, как пользоваться сейфом, сотрудник банка выходит из депозитария. Никто кроме вас не присутствует там в момент вложения ценностей в ячейку — таким образом соблюдается полная конфиденциальность. ССБ⁠ высоко ценит ваше доверие. Если вы поместили ценные вещи в индивидуальный сейф, мы гарантируем их полную сохранность и абсолютную неприкосновенность.'
        },
      ],
      documents: [
        {
          id: 1,
          name: 'Органический трафик продолжает удивлять 1',
          size: '389,4 Кб',
          link: '/documents/test.docx',
          type: 'pdf'
        },
        {
          id: 2,
          name: 'Органический трафик продолжает удивлять 2',
          size: '329,4 Кб',
          link: '/documents/test.docx',
          type: 'doc'
        },
        {
          id: 3,
          name: 'Органический трафик продолжает удивлять 3',
          size: '489,4 Кб',
          link: '/documents/test.docx',
          type: 'pdf'
        },
        {
          id: 4,
          name: 'Органический трафик продолжает удивлять 4',
          size: '384,4 Кб',
          link: '/documents/test.docx',
          type: 'doc'
        },
        {
          id: 5,
          name: 'Органический трафик продолжает удивлять 5',
          size: '3890,4 Кб',
          link: '/documents/test.docx',
          type: 'pdf'
        },
        {
          id: 6,
          name: 'Органический трафик продолжает удивлять 6',
          size: '379,4 Кб',
          link: '/documents/test.docx',
          type: 'doc'
        },
      ]
    }
  }
}
</script>
