<template>
  <section>
    <div class="main__container px-6 xl:px-0 pt-6">
      <Titles class="mb-6">
        Вакансии
      </Titles>
      <div class="flex flex-col gap-6 mb-6">
        <CardVacancy v-for="item in vacancy" :key="item.id"
        :item="item"
        :list="vacancy"/>
      </div>
    </div>
  </section>
</template>
<script>
export default {
  name: 'VacancyPage',
  data() {
    return {
      vacancy: [
        {
          id: 1,
          name: 'Специалист по информационной безопасности 1',
          duties: 'управление доступом пользователей в информационных системах; работа с криптографическими ключами; работа с антивирусными системами и другими системами информационной безопасности; выявление, реагирование и участие в расследовании инцидентов информационной безопасности.',
          advantages: [
            {
              title: 'Крайний срок подачи анкет',
              description: '20.04.2021 16:00:00'
            },
            {
              title: 'Регион',
              description: 'г. Худжанд, Головной офис'
            },
          ]
        },
        {
          id: 2,
          name: 'Специалист по информационной безопасности 2',
          duties: 'управление доступом пользователей в информационных системах; работа с криптографическими ключами; работа с антивирусными системами и другими системами информационной безопасности; выявление, реагирование и участие в расследовании инцидентов информационной безопасности.',
          advantages: [
            {
              title: 'Крайний срок подачи анкет',
              description: '20.04.2021 16:00:00'
            },
            {
              title: 'Регион',
              description: 'г. Худжанд, Головной офис'
            },
          ]
        },
        {
          id: 3,
          name: 'Специалист по информационной безопасности 3',
          duties: 'управление доступом пользователей в информационных системах; работа с криптографическими ключами; работа с антивирусными системами и другими системами информационной безопасности; выявление, реагирование и участие в расследовании инцидентов информационной безопасности.',
          advantages: [
            {
              title: 'Крайний срок подачи анкет',
              description: '20.04.2021 16:00:00'
            },
            {
              title: 'Регион',
              description: 'г. Худжанд, Головной офис'
            },
          ]
        },
        {
          id: 4,
          name: 'Специалист по информационной безопасности 4',
          duties: 'управление доступом пользователей в информационных системах; работа с криптографическими ключами; работа с антивирусными системами и другими системами информационной безопасности; выявление, реагирование и участие в расследовании инцидентов информационной безопасности.',
          advantages: [
            {
              title: 'Крайний срок подачи анкет',
              description: '20.04.2021 16:00:00'
            },
            {
              title: 'Регион',
              description: 'г. Худжанд, Головной офис'
            },
          ]
        },
      ]
    }
  }
}
</script>
