<template>
  <div>
    <Banner :banner="banner"/>
    <div class="max-w-[846px] mx-auto mt-20 px-6 lg:px-0">
      <ul class="flex flex-col gap-6">
        <li v-for="(item, index) in faq" :key="index">
          <Faq :faq="item"
          :activeFaq="activeFaq"
          @click="openQuestion(item)"/>
        </li>
      </ul>
    </div>
  </div>
</template>
<script>
export default {
  data() {
    return {
      banner: {
        title: 'Остались вопросы?',
        description: 'Удобное надежное и безопасное место для хранения ценностей',
        img: {
          src: '/image/question.webp',
          alt: 'Question'
        }
      },
      activeFaq: null,
      faq: [
        {
          id: 1,
          active: false,
          title: 'Кровь стынет в жилах',
          description: 'Равным образом, перспективное планирование в значительной степени обусловливает важность распределения внутренних резервов и ресурсов. Равным образом, убеждённость некоторых оппонентов в значительной степени обусловливает важность поставленных обществом задач. Являясь всего лишь частью общей картины, стремящиеся вытеснить традиционное производство, нанотехнологии, которые представляют собой яркий пример континентально-европейского типа политической культуры, будут рассмотрены исключительно в разрезе маркетинговых и финансовых предпосылок. А ещё тщательные исследования конкурентов, инициированные исключительно синтетически, обнародованы.'
        },
        {
          id: 2,
          active: false,
          title: 'Кровь стынет в жилах',
          description: 'Равным образом, перспективное планирование в значительной степени обусловливает важность распределения внутренних резервов и ресурсов. Равным образом, убеждённость некоторых оппонентов в значительной степени обусловливает важность поставленных обществом задач. Являясь всего лишь частью общей картины, стремящиеся вытеснить традиционное производство, нанотехнологии, которые представляют собой яркий пример континентально-европейского типа политической культуры, будут рассмотрены исключительно в разрезе маркетинговых и финансовых предпосылок. А ещё тщательные исследования конкурентов, инициированные исключительно синтетически, обнародованы.'
        },
        {
          id: 3,
          active: false,
          title: 'Кровь стынет в жилах',
          description: 'Равным образом, перспективное планирование в значительной степени обусловливает важность распределения внутренних резервов и ресурсов. Равным образом, убеждённость некоторых оппонентов в значительной степени обусловливает важность поставленных обществом задач. Являясь всего лишь частью общей картины, стремящиеся вытеснить традиционное производство, нанотехнологии, которые представляют собой яркий пример континентально-европейского типа политической культуры, будут рассмотрены исключительно в разрезе маркетинговых и финансовых предпосылок. А ещё тщательные исследования конкурентов, инициированные исключительно синтетически, обнародованы.'
        },
        {
          id: 4,
          active: false,
          title: 'Кровь стынет в жилах',
          description: 'Равным образом, перспективное планирование в значительной степени обусловливает важность распределения внутренних резервов и ресурсов. Равным образом, убеждённость некоторых оппонентов в значительной степени обусловливает важность поставленных обществом задач. Являясь всего лишь частью общей картины, стремящиеся вытеснить традиционное производство, нанотехнологии, которые представляют собой яркий пример континентально-европейского типа политической культуры, будут рассмотрены исключительно в разрезе маркетинговых и финансовых предпосылок. А ещё тщательные исследования конкурентов, инициированные исключительно синтетически, обнародованы.'
        },
        {
          id: 5,
          active: false,
          title: 'Кровь стынет в жилах',
          description: 'Равным образом, перспективное планирование в значительной степени обусловливает важность распределения внутренних резервов и ресурсов. Равным образом, убеждённость некоторых оппонентов в значительной степени обусловливает важность поставленных обществом задач. Являясь всего лишь частью общей картины, стремящиеся вытеснить традиционное производство, нанотехнологии, которые представляют собой яркий пример континентально-европейского типа политической культуры, будут рассмотрены исключительно в разрезе маркетинговых и финансовых предпосылок. А ещё тщательные исследования конкурентов, инициированные исключительно синтетически, обнародованы.'
        },
      ]
    }
  },
  methods: {
    openQuestion(item) {
      if(item.id === this.activeFaq) {
        this.activeFaq = null
      } else {
        this.activeFaq = item.id
      }
    }
  }
}
</script>
