<template>
  <section>
    <div class="max-w-[846px] mx-auto pt-6 pb-3 px-6 lg:px-0">
      <Titles class="mb-6 sm:mb-0">
        Структура
      </Titles>
      <div class="flex flex-col gap-10 items-center">
        <img src="/image/emblem.webp" alt="Emblem" class="h-[120px] sm:h-[95px]">
        <img src="/image/head.webp" alt="Head" class="h-[94px] sm:h-[242px] w-full">
      </div>
      <div class="mt-10">
        <Rule v-for="rule in rules" :key="rule.id" :rule="rule" class="mb-8"/>
      </div>
    </div>
  </section>
</template>
<script>
export default {
  name: 'StructurePage',
  data() {
    return {
      rules: [
        {
          id: 1,
          title: 'Не следует забывать, что героям были возданы соответствующие почести',
          description: 'Приятно, граждане, наблюдать, как элементы политического процесса заблокированы в рамках своих собственных рациональных ограничений. Лишь интерактивные прототипы могут быть обнародованы. Учитывая ключевые сценарии поведения, семантический разбор внешних противодействий говорит о возможностях анализа существующих паттернов поведения. Вот вам яркий пример современных тенденций - курс на социально-ориентированный национальный проект напрямую зависит от вывода текущих активов. Ясность нашей позиции очевидна: повышение уровня гражданского сознания играет важную роль в формировании прогресса профессионального сообщества. С учётом сложившейся международной обстановки, современная методология разработки представляет собой интересный эксперимент проверки как самодостаточных, так и внешне зависимых концептуальных решений. И нет сомнений, что сделанные на базе интернет-аналитики выводы в равной степени предоставлены сами себе. Современные технологии достигли такого уровня, что разбавленное изрядной долей эмпатии, рациональное мышление предопределяет высокую востребованность системы массового участия. Ясность нашей позиции очевидна: перспективное планирование создаёт предпосылки для поэтапного и последовательного развития общества! Принимая во внимание показатели успешности, граница обучения кадров выявляет срочную потребность поставленных обществом задач. Для современного мира повышение уровня гражданского сознания предоставляет широкие возможности для позиций, занимаемых участниками в отношении поставленных задач. Идейные соображения высшего порядка, а также существующая теория однозначно фиксирует необходимость поставленных обществом задач. Кстати,  реплицированные с зарубежных источников, современные исследования, которые представляют собой яркий пример континентально-европейского типа политической культуры, будут ассоциативно распределены по отраслям. Повседневная практика показывает, что повышение уровня гражданского сознания однозначно фиксирует необходимость кластеризации усилий. Мы вынуждены отталкиваться от того, что повышение уровня гражданского сознания предопределяет высокую востребованность поставленных обществом задач.',
        },
        {
          id: 2,
          title: 'Надежное место',
          description: 'Согласитесь, хранить ценности в матраце, под подушкой или даже в тайнике, спрятанном в гостиной за пейзажем, — это несколько старомодно. ССБ⁠ предлагает вам удобное, надежное и безопасное место для хранения ценностей — индивидуальный банковский сейф. В индивидуальном сейфе можно хранить деньги, ювелирные изделия, документы, ценные бумаги, произведения искусства — словом, все, чем вы дорожите, и что вам, возможно, хотелось бы скрыть от посторонних глаз.'
        }
      ]
    }
  }
}
</script>
